-- phpMyAdmin SQL Dump
-- version 4.9.0.1
-- https://www.phpmyadmin.net/
--
-- 主機： localhost
-- 產生時間： 2021 年 05 月 18 日 09:38
-- 伺服器版本： 10.4.6-MariaDB
-- PHP 版本： 7.3.9

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `tocc`
--

-- --------------------------------------------------------

--
-- 資料表結構 `customer`
--

CREATE TABLE `customer` (
  `cusname` varchar(64) NOT NULL,
  `custel` varchar(15) DEFAULT NULL,
  `cusaddr` varchar(256) DEFAULT NULL,
  `cusid` varchar(15) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `customer`
--

INSERT INTO `customer` (`cusname`, `custel`, `cusaddr`, `cusid`) VALUES
('誠美牙醫診所', '04-7512786', '自強南路443之1號1、2樓', '3701013348'),
('久恆牙醫診所', '02-37652255', '台北市松山區民生東路五段93號', '3701013580'),
('勤美民生牙醫診所', '02-27600289', '台北市松山區民生東路五段58號', '3701013884'),
('魔法兔齒顎矯正專科診所', '02-27660655', '台北市松山區東興路2巷5號', '3701013982'),
('八德牙醫診所', '', '八德路四段678號', '3701014112'),
('本質牙醫診所', '02-37651105', '南京東路五段167號1、2樓', '3701014130'),
('亞德牙醫診所', '02-23621177', '台北市大安區羅斯福路三段171號', '3701024270'),
('松林牙醫診所', '02-27547628', '台北市大安區延吉街233巷8號', '3701027440'),
('皓美牙醫診所', '04-24817793', '台中市大里區永興路20號', '3701027502'),
('健誌牙醫診所', '02-23222966', '台北市大安區金山南路二段152號', '3701027986'),
('耀美牙醫診所', '02-27718686', '忠孝東路四段1號4樓', '3701028107'),
('里昂哈佛仁愛牙醫診所', '02-23252100', '台北市大安區仁愛路四段416,418號2F', '3701028198'),
('大安-美德美學牙醫診所', '02-27711033', '台北市大安區忠孝東路4段230號6樓', '3701028401'),
('君漾美牙醫診所', '02-27713585', '忠孝東路四段250號4樓', '3701028607'),
('尊榮美學牙醫診所', '02-25533202', '台北市大同區承德路二段172、176號', '3701092456'),
('立威口腔顎面外科牙醫診所', '0225852508', '重慶北路三段280號', '3701092509'),
('康寧牙醫診所', '04-24635000', '台中市西屯區西屯路三段169-6號1樓', '3701100220'),
('新現代牙醫診所', '05-3661313', '嘉義縣太保市太保里17之3號', '3701100364'),
('陽安牙醫診所', '02-25044633', '台北市中山區民權東路二段152巷3號', '3701100542'),
('迪士尼牙醫診所', '02-25322775', '台北市中山區北安路554巷8弄1號1樓', '3701103472'),
('晴美牙醫診所', '02-25000815', '台北市中山區復興北路350號2樓', '3701105190'),
('勤美悠植牙醫診所', '02-87732001', '台北市中山區南京東路三段208號2樓', '3701105403'),
('長木牙醫診所', '02-85012306', '台北市中山區樂群二路185號', '3701105565'),
('爵世牙醫診所', '', '中山北路二段179號1.2樓', '3701105627'),
('慕光牙醫診所', '', '台北市中山區南京東路二段75號(實際營業樓層：第一層、第二層)', '3701105672'),
('優生活牙醫診所', '02-227997373', '台北市內湖區文德路169號', '3701112748'),
('品牙醫診所', '02-27906882', '台北市內湖區成功路4段175號', '3701112775'),
('金陽牙醫診所', '02-26307295', '台北市內湖區康樂街78號', '3701112864'),
('天悅牙醫診所', '0228338800', '台北市士林區中山北路六段268號', '3701157676'),
('方圓牙醫診所', '04-26624396', '台中市沙鹿區中山路400之1號1、2樓', '3701160682'),
('群欣牙醫診所', '04-7278188', '彰化縣彰化市中正路一段217號', '3701161036'),
('向日葵牙醫診所', '02-22323003', '中和路410號1、2樓', '3701162364'),
('聯安牙醫診所', '0227695085', '虎林街32之1號1樓', '3701171541'),
('瑞比牙醫診所', '02-27202202', '台北市信義區莊敬路478號2樓之4之6', '3701173401'),
('雅術牙醫診所', '02-27275586', '台北市信義區忠孝東路五段510號之1', '3701173741'),
('品軒牙醫診所', '02-27565685', '市民大道六段250號3、4樓', '3701173947'),
('三民牙醫診所', '03-3379333', '民光路87號', '3701180264'),
('雅德思牙醫診所', '0223140806', '重慶南路一段66號', '3701183845'),
('佳新牙醫診所', '03-4368220', '桃園市中壢區中山東路二段97號', '3701190528'),
('萬華賴牙醫診所', '', '台北市萬華區西園路二段180號', '3701192488'),
('唯芯牙醫診所', '02-29390852', '木柵路三段51號、51號2樓、53號2樓、55號2樓', '3701202550'),
('誠一牙醫診所', '', '興隆路四段191號', '3701202603'),
('大昌牙醫診所', '07-3860066', '大昌二路67號1樓、夾層、2樓', '3702053588'),
('笛雅牙醫診所', '0425235738', '圓環東路455號1樓及2樓', '3703010032'),
('安邑美學牙醫診所', '0425346681', '豐原大道一段637號1、2樓', '3703010078'),
('御耀美學牙醫診所', '04-25250909', '中正路572之1號1樓', '3703010112'),
('合麗牙醫診所', '04-25880685', '台中市東勢區豐勢路455、457號1樓', '3703020010'),
('昕宇牙醫診所', '04-26621001', '日新街67號1、2樓', '3703050072'),
('開心美學牙醫診所', '04-25633396', '民生路13號1、2樓', '3703080043'),
('和顏牙醫診所', '04-25317189', '台中市潭子區潭興路三段102號2樓', '3703090067'),
('立德牙醫診所', '04-25315081', '台中市潭子區興華一路286號1、2樓', '3703090076'),
('晶新牙醫診所', '04-23385599', '台中市烏日區三榮路二段13號1、2樓', '3703150013'),
('太平-安馨牙醫診所', '0423911815', '育賢路143號1、2、3樓', '3703190071'),
('蘊和牙醫診所', '04-23952895', '育賢路61號1樓及2樓', '3703190080'),
('星星牙醫診所', '', '台中市太平區太順路401號1樓', '3703190133'),
('幸福牙醫診所', '0424073175', '大明路427號1、2樓', '3703200072'),
('大美牙醫診所', '', '台中市大里區甲堤南路68、69號1、2樓', '3703200143'),
('雅仕牙醫診所', '04-24960123', '台中市大里區中興路一段292之1號1、2樓及292之10號1樓', '3703200161'),
('向日牙醫診所', '04-22738686', '自強街33號1、2樓', '3703200198'),
('敦御牙醫診所', '04-23283887', '台中市西區臺灣大道二段489號20樓之三', '3703240101'),
('昕展牙醫診所', '0424730325', '向上南路一段166-5號', '3703240209'),
('璞研美學牙醫診所', '04-22611661', '建成路1906號', '3703250090'),
('科隆白金牙醫診所', '0800037168', '復興路一段380號2樓', '3703250134'),
('銓臻美學牙醫診所', '0800037168', '復興路一段380號3樓', '3703250143'),
('小貝齒牙醫診所', '0800037168', '復興路一段380號5樓', '3703250152'),
('謙和牙醫診所', '04-23190269', '英才路394號1樓', '3703260032'),
('常勝美學牙醫診所', '04-22076762', '台中市北區美德街187號', '3703260069'),
('衍豪牙醫診所', '04-22052888', '台中市北區民權路417號', '3703260167'),
('齊昕牙醫診所', '04-22066660', '文化街1號1、2樓', '3703260247'),
('永盛牙醫診所', '04-22930668', '台中市西屯區長安路二段140號1樓', '3703270092'),
('銘家牙醫診所', '04-23281819', '台中市西屯區大祥街8號1樓', '3703270145'),
('寬庭牙醫診所', '04-24513668', '台中市西屯區西屯路二段251之4號', '3703270216'),
('李宜昇牙醫診所', '0423129519', '台中市西屯區文心路三段6之1號1&2樓', '3703270261'),
('朗日牙藝牙醫診所', '04-27082733', '台中市西屯區黎明路三段169號1、2樓', '3703270298'),
('新月牙醫診所', '04-24523575', '台中市西屯區青海路二段320號1樓及夾層', '3703270305'),
('小野美學牙醫診所', '04-22535138', '台中市西屯區龍門路32號1、2樓', '3703270332'),
('康宸牙醫診所', '0423829191', '台中市南屯區河南路四段483號1、2樓', '3703280070'),
('展悅牙醫診所', '04-22595577', '公益路二段625號1、2樓', '3703280098'),
('睿恩美學牙醫診所', '22515200', '台中市南屯區河南路四段326號3樓', '3703280132'),
('張文信牙醫診所', '04-23200250', '台中市南屯區大墩路817號', '3703280212'),
('圓滿牙醫診所', '04-22521352', '台中市南屯區大業路577號1、2樓', '3703280221'),
('雅緹斯牙醫診所', '04-23862399', '台中市南屯區大墩七街327號3樓', '3703280249'),
('洪英凱牙醫診所', '0423201682', '台中市南屯區大聖街182號', '3703280276'),
('正百牙醫診所', '04-24733839', '台中市南屯區東興路二段388、340號1、2樓', '3703280310'),
('悅容牙醫診所', '04-24738883', '台中市南屯區向心南路758號1樓', '3703280329'),
('樂慕牙醫診所', '04-23208518', '大墩路589號', '3703280392'),
('新美佳牙醫診所', '04-24223608', '台中市北屯區四平路348號1、2樓', '3703290076'),
('艾莉絲牙醫診所', '04-22348358', '台中市北屯區文心路四段688號1、2樓', '3703290101'),
('艾美牙醫診所', '04-22450032', '台中市北屯區松竹路二段347號1、2樓', '3703290129'),
('三鼎牙醫診所', '04-24379061', '台中市北屯區軍功路一段409號1樓及夾層', '3703290165'),
('維德美學牙醫診所', '04-24262967', '台中市北屯區敦化路一段452號', '3703290209'),
('佳品牙醫診所', '0422470710', '台中市北屯區大連路二段206號', '3703290227'),
('立頓牙醫診所', '04-24222101', '台中市北屯區崇德十路一段383號1、2樓', '3703290263'),
('元艾美牙醫診所', '04-22476542', '遼寧路一段145號1、2、3樓', '3703290272'),
('莊培欣牙醫診所', '04-22339363', '東山路一段40之2號1樓', '3703290307'),
('立恩牙醫診所', '0422355670', '北平路三段51號1、2樓', '3703290316'),
('喨粒晶牙醫診所', '04-22916565', '中清路二段488號', '3703290334'),
('品川牙醫診所', '06-6565658', '金華路一段390號1樓', '3705010076'),
('遠傳牙醫診所', '065850339', '光文里大成路306號1樓', '3705070018'),
('曉樹牙醫診所', '06-3023181', '台南市永康區東橋十街7號1、2樓', '3705310062'),
('杏采牙醫診所', '', '東灣里大灣路390號1樓', '3705310080'),
('樂康牙醫診所', '06-3020620', '台南市永康區東橋六街65號1樓', '3705310124'),
('郭建良牙醫診所', '06-3029198', '東橋六街95號1樓', '3705310133'),
('大欣牙醫診所', '', '東橋里東橋五路106號、108號、110號1樓', '3705310151'),
('獨角獸牙醫診所', '06-3020770', '東橋八街208號', '3705310160'),
('金典牙醫診所', '06-2008340', '台南市東區長榮路二段106號1樓', '3705320184'),
('德藝牙醫診所', '06-2627000', '喜東里明興路633-3號1樓', '3705330064'),
('日光DC牙醫診所', '06-2234922', '台南市中西區民生路二段383號1、2樓', '3705340088'),
('台南-沐辰牙醫診所', '063585211', '西湖里中華西路二段713號1、2樓', '3705340104'),
('聯宏牙醫診所', '06-2211398', '台南市北區公園南路345號', '3705350011'),
('徠爾牙醫診所', '', '三德里忠義路三段111號1樓', '3705350020'),
('維哲美學牙醫診所', '06-2516600', '成德里和緯路二段162號1樓', '3705350048'),
('源遠號牙醫診所', '06-2229919', '台南市北區公園南路355號1、2樓', '3705350066'),
('禾悅美學牙醫診所', '06-2086968', '台南市北區開元路513號', '3705350075'),
('拇山號牙醫診所', '06-2229918', '公園南路351號1、2樓', '3705350100'),
('品硯牙醫診所', '', '海安路三段868號', '3705350137'),
('光美牙醫診所', '062988381', '怡平路77號1、2樓', '3705380091'),
('百世專業牙醫診所', '07-7351316', '文龍東路296號1-2樓', '3707010234'),
('壹八八美學牙醫診所', '07-7193018', '高雄市鳳山區三民路77號1-2樓', '3707010243'),
('幸儀牙醫診所', '07-7130899', '高雄市鳳山區武慶二路42號1、2樓', '3707010252'),
('合悅美學牙醫診所', '07-7010033', '高雄市鳳山區勝利路51號1-2樓', '3707010298'),
('景泰牙醫診所', '07-7260808', '保泰路400號1、2樓', '3707010332'),
('誠心牙醫診所', '07-7822038', '鳳林路258號1-2樓', '3707010341'),
('風華牙醫診所', '07-6416181', '高雄市林園區王公路233號', '3707050041'),
('晨心牙醫診所', '07-3736699', '高雄市仁武區八德中路82號', '3707080085'),
('艾迪爾牙醫診所', '073705309', '澄明街210號1樓', '3707100028'),
('高雄-威登牙醫診所', '07-6967525', '大社路177-1號1樓', '3707150019'),
('登美牙醫診所', '07-5571223', '博愛二路360-1號1-2樓', '3707300279'),
('森森美學牙醫診所', '07-3555222', '高雄市楠梓區清豐三路385號1、2、3樓', '3707310097'),
('尚愛牙醫診所', '07-3222355', '青島街26號1、2樓', '3707320128'),
('新悅美學牙醫診所', '07-3929555', '陽明路155號1、2樓', '3707320271'),
('璞美牙醫診所', '07-7775750', '文濱路29號', '3707320324'),
('元正牙醫診所', '07-7808711', '建國路三段410號1~2樓', '3707320333'),
('高加牙醫診所', '072353600', '洛陽街70號一樓72號一樓', '3707330017'),
('維品牙醫診所', '07-2692092', '高雄市苓雅區永泰路69號1、2樓', '3707350091'),
('小怪獸兒童與青少年牙醫診所', '07-3380810', '四維二路329號1樓及夾層', '3707350144'),
('人本自然牙醫診所', '', '民權二路98號', '3707360033'),
('貝陽兒童牙醫診所', '02-24258001', '基隆市仁愛區仁二路95號3樓', '3711041569'),
('君悅牙醫診所', '02-29945329', '中正路160號1樓及162號地下一層', '3711041578'),
('貝多芬牙醫診所', '03-5749567', '新竹市東區建功一路59巷6號', '3712010791'),
('安徒生牙醫診所', '03-5749385', '新竹市東區建功一路87號', '3712012329'),
('明威牙醫診所', '', '新竹市東區關新路19巷31號', '3712012393'),
('金牛頓牙醫診所', '03-5733896', '新竹市東區建功一路176、178號', '3712012482'),
('森源牙醫診所', '03-5728088', '綠水里光復路二段261號1、2樓', '3712012491'),
('詠美牙醫診所', '035351153', '新竹市東區鐵道路一段18號', '3712012517'),
('峰皇牙醫診所', '03-5243666', '新竹市東區東門街29、31號', '3712012526'),
('紐約牙醫診所', '03-5152206', '新竹市東區民生路309號2樓', '3712012553'),
('貝爾牙醫診所', '03-5750077', '新竹市東區建功一路59巷12號1樓', '3712012615'),
('日光翡麗牙醫診所', '03-5678699', '新竹市東區關新路65號', '3712012624'),
('和毅牙醫診所', '03-5228866', '新竹市東區林森路149號1、2樓', '3712012651'),
('東門牙醫診所', '03-5281250', '東門街67號1樓', '3712012722'),
('天晴牙醫診所', '035775206', '龍山里慈濟路206號1樓', '3712012731'),
('皓齊牙醫診所', '03-5621009', '南大路397號1、2樓', '3712012740'),
('東寧牙醫診所', '035260768', '北區中央路89、91號', '3712040280'),
('雅緻生活牙醫診所', '03-5356505', '水田街51號1、2樓', '3712041821'),
('九歌牙醫診所', '035341616', '東大路二段188號', '3712041867'),
('彼德潘牙醫診所', '03-5408285', '新竹市北區武陵路82號1樓', '3712041938'),
('富康牙醫診所', '0422155100', '台中市東區十甲東路572號1樓', '3717021507'),
('楊史伯牙醫診所', '0423725222', '臺中市西區五權西二街32號', '3717030122'),
('承群牙醫診所', '04-23781683', '台中市西區美村路一段793號1、2樓', '3717032377'),
('上誠牙醫診所', '04-23285795', '台中市西區臺灣大道二段489號20樓之一', '3717032617'),
('名加牙醫診所', '04-23052456', '台中市西區英才路501號2樓', '3717032653'),
('陳志勳牙醫診所', '04-22626769', '台中市南區復興路一段306號', '3717040486'),
('能盛牙醫診所', '04-22368988', '台中市北區崇德路一段139號', '3717050446'),
('善爵牙醫診所', '04-22519328', '台中市西屯區惠中路一段120號1、2樓', '3717062768'),
('淳康牙醫診所', '04-24518989', '河南路二段356號1、2、3樓', '3717062815'),
('童齡牙醫診所', '04-23809511', '台中市南屯區永春東路1057號2、3、4樓', '3717070859'),
('豐美牙醫診所', '04-24726565', '台中市南屯區向心南路720、722號1樓', '3717072577'),
('啄木鳥牙醫診所', '04-22549955', '台中市南屯區河南路四段194號2樓', '3717072693'),
('仁信牙醫診所', '0422451968', '興安路一段280號1樓', '3717081085'),
('潔宇牙醫診所', '0422378918', '文心路四段482號1樓', '3717082582'),
('晶晶牙醫診所', '04-22916565', '四平路41、43號1樓 原址', '3717082662'),
('經典牙醫診所', '', '金華路二段309號1~2樓', '3721021597'),
('正光牙醫診所', '06-2283066', '成功路323-327號1、2樓，331號1樓', '3721030309'),
('日安牙醫診所', '06-2510101', '成德里和緯路2段207號1-2樓', '3721041900'),
('戴牙醫診所', '', '南美里友愛街88號1樓', '3721050472'),
('人文新境牙醫診所', '05-2763456', '大雅路一段606號1、2樓', '3722011915'),
('光禾牙醫診所', '', '民生北路294號1樓', '3722021902'),
('吉祥牙醫診所', '037-667057', '苗栗縣頭份市崇仁街29號1樓', '3731010702'),
('太平新品牙醫診所', '04-23936000', '台中市太平區中山路三段2之9號1樓', '3731012206'),
('東暘牙醫診所', '0282586868', '雨農路30號1樓．32號1樓，32號2樓', '3731014228'),
('新板耀美牙醫診所', '02-22710777', '文化路1段85號1、2樓', '3731014728'),
('精品牙醫診所', '03-4942765', '桃園縣平鎮市育達路二段96號1、2樓', '3731014880'),
('莫札特牙醫診所', '0229670682', '合宜路91號1樓', '3731015065'),
('展揚牙醫診所', '', '南雅南路二段144巷68號1樓', '3731015092'),
('江翠牙醫診所', '02-22767256', '雙十路二段165號1、2樓', '3731015172'),
('祐民牙醫診所', '0229767874', '', '3731022917'),
('頌恩牙醫診所', '02-28577905', '新北市三重區碧華街362號1、2樓', '3731023325'),
('博誠牙醫診所', '02-86608555', '新北市永和區中正路417號1、2樓', '3731033536'),
('永漾美學牙醫診所', '0229220201', '永貞路422號1樓、420號2樓', '3731033689'),
('柯牙醫診所', '03-5518686', '博愛街561號1樓', '3731043023'),
('鼎爵牙醫診所', '0282212997', '連城路286號', '3731043274'),
('進新牙醫診所', '02-29186062', '光明街312號1樓', '3731050242'),
('永佳牙醫診所', '02-29127721', '新北市新店區北新路二段195號1、2樓', '3731050699'),
('白玉牙醫診所', '02-29121233', '北新路三段88號1、2樓', '3731052817'),
('沐晨牙醫診所', '0229176070', '順安街60、62號1、2樓', '3731052899'),
('康勝牙醫診所', '02-29919649', '昌隆街90號', '3731060220'),
('品森美學牙醫診所', '', '新北市新莊區思源路130號', '3731063570'),
('茁越牙醫診所', '02-86781685', '新北市鶯歌區建國路115號1、2樓&115-1號1樓', '3731081354'),
('大同牙醫診所', ' 0226748682', '大同路7號', '3731091207'),
('得意牙醫診所', '02-26729979', '學成路333號1樓', '3731091378'),
('雲天牙醫診所', '02-26411476', '新台五路一段272、276號1、2樓', '3731112078'),
('多麗美學牙醫診所', '02-26421222', '大同路2段231號1樓', '3731112087'),
('仁和牙醫診所', '0222607442', '中央路二段223號之1', '3731130727'),
('五股晴美牙醫診所', '02-22936889', '成泰路一段237-15號', '3731151511'),
('禾杏牙醫診所', '02-85311316', '新北市泰山區明志路二段121號2樓', '3731161295'),
('沃德牙醫診所', '02-26086699', '新北市林口區忠孝路381號', '3731171193'),
('康澤牙醫診所', '02-26022995', '新北市林口區中山路255號1、2樓', '3731171282'),
('展心牙醫診所', '0226012121', '文化三路二段36號一樓', '3731171291'),
('三井牙醫診所', '02-26002076', '新北市林口區文化三路一段179號1、2樓', '3731171317'),
('極致美學牙醫診所', '02-26092690', '新台北林口區文化三路一段463號', '3731171326'),
('萊德美學牙醫診所', '0226005341', '新北市林口區文化二路一段283號1、2樓', '3731171344'),
('頭等艙牙醫診所', '', '新北市林口區文化三路一段191巷20號1樓及夾層', '3731171399'),
('展研牙醫診所', '02-26009191', '新北市林口區忠孝一路1號1樓、5號2樓', '3731171415'),
('彤學牙醫診所', '', '新北市林口區仁愛路二段241號1.2樓', '3731171433'),
('正大牙醫診所', '03-3355226', '桃園市桃園區永樂街144號', '3732010073'),
('楊牙醫診所', '03-3383168', '三民路三段166號1、2樓', '3732010322'),
('古秀傳牙醫診所', '032206780', '桃園市桃園區中山路264號', '3732010902'),
('杏宏牙醫診所', '03-3335993', '桃園市桃園區民生路287號1、2樓', '3732011052'),
('禾豐牙醫診所', '03-3608889', '桃園市桃園區吉昌街218號1、2樓', '3732013467'),
('達美牙醫診所', '03-2200088', '桃園市桃園區中平路95號2樓', '3732013547'),
('潔德美學牙醫診所', '03-3172286', '桃園市桃園區同德11街78號1樓', '3732013565'),
('完美牙醫診所', '03-3465000', '桃園市桃園區春日路848號1、2樓', '3732013645'),
('合康美學牙醫診所', '03-3566388', '桃園市桃園區中埔六街7號1樓', '3732013743'),
('用心牙醫診所', ' 03-3350159', '桃園市桃園區民安路100號', '3732013752'),
('昶佳牙醫診所', '', '新埔六街197號1樓及2樓', '3732014106'),
('佑語牙醫診所', '03-3699566', '正光路203巷10號', '3732014124'),
('向陽藝心牙醫診所', '033602260', '正光路207號1樓', '3732014151'),
('佳禾牙醫診所', '03-4580600', '桃園市中壢區五華街100號1樓', '3732023347'),
('晶悅牙醫診所', '03-4257710', '桃園市中壢區新生路251號1、2樓', '3732023356'),
('晶華牙醫診所', '03-4256330', '桃園市中壢市新生路273號1、2樓', '3732023365'),
('品皓牙醫診所', '032871008', '桃園市中壢區領航北路二段98號', '3732023374'),
('環宇數位牙醫診所', '03-4257630', '桃園縣中壢市元化路二段25號1、2、3樓', '3732023383'),
('方羽美學牙醫診所', '03-4020505', '中央西路二段263號1、2樓', '3732023418'),
('星隆牙醫診所', '03-4352535', '桃園市中壢區興農路82號1樓', '3732023481'),
('樂琪牙醫診所', '03-4526777', '環北路443號3樓', '3732023525'),
('爵欣牙醫診所', '', '員林路一段175號', '3732031330'),
('天祥牙醫診所', '03-4757766', '桃園市楊梅區大成路156號1樓', '3732041407'),
('品叡牙醫診所', '03-4826609', '桃園市楊梅區瑞溪路二段156號1樓', '3732041470'),
('蘆竹長興牙醫', '03-3137122', '大新路19號', '3732051538'),
('四季牙醫診所', '03-2122120', '桃園市蘆竹區吉林路149號1、2樓', '3732051663'),
('玉米田兒童青少年牙醫診所', '03-2225670', '桃園市蘆竹區吉林路12號3樓', '3732051814'),
('樂心牙醫診所', '02-82008696', '桃園市龜山區龍新街58號', '3732071610'),
('睿凡牙醫診所', '03-3277722', '桃園市龜山區文化三路315號', '3732071638'),
('樂沛牙醫診所', '03-3770885', '桃園市八德區大智路131、133號1樓', '3732081652'),
('樂芙兒童牙醫診所', '', '桃園市八德區廣豐三街8號1樓及1樓夾層', '3732081778'),
('杏昌牙醫診所', '034896600', '中興路431號1、2樓', '3732090106'),
('米樂牙醫診所', '04-23716020', '台中市西區英才路639號1、2樓', '3732101631'),
('柯壹牙醫診所', '03-4393555', '桃園市平鎮區上海路188號2樓', '3732101695'),
('良壹牙醫診所', '03-4949988', '桃園市平鎮區民族路二段145號1、2樓', '3732101748'),
('揚洋牙醫診所', '03-4761222', '桃園市觀音區大觀路二段236號1-4樓', '3732121179'),
('正霖牙醫診所', '03-6583511', '新竹縣竹北市莊敬五街8號', '3733051309'),
('微風牙醫診所', '035589911', '新竹縣竹北市縣政二路588號', '3733051345'),
('皓品牙醫診所', '04-25273880', '台中市豐原區豐西街1號1樓', '3733051387'),
('早安美學牙醫診所', NULL, NULL, '3733051587'),
('悅日牙醫診所', '03-5500133', '勝利二路36號2樓', '3733051612'),
('傳有牙醫診所', '03-6670333', '新竹縣竹北市嘉豐南路一段68號', '3733051685'),
('美熙牙醫診所', '03-5558003', '新竹縣竹北市博愛街474號1、2樓', '3733051701'),
('展群牙醫診所', '03-6573215', '新竹縣竹北市縣政二路60號', '3733051756'),
('小廖叔叔牙醫診所', '03-5500071', '成功三路161號1、2樓', '3733051809'),
('時麥二生活牙醫診所', '', '新竹縣竹北市成功三路92號1樓及2樓', '3733051836'),
('新工牙醫診所', '035979287', '新竹縣湖口鄉仁和路107號', '3733061118'),
('安鈺牙醫診所', '03-5595242', '新竹縣新豐鄉新興路117號1樓', '3733081183'),
('欣美牙醫診所', '039358999', '自強路17、19號', '3734011541'),
('好日牙醫診所', '039556602', '純精路二段180號.180號2樓', '3734021565'),
('永銨牙醫診所', '03-9581585', '宜蘭縣冬山鄉永安路301號', '3734080055'),
('雲展牙醫診所', '037-355399', '玉清路39號1樓', '3735011429'),
('寶格儷牙醫診所', '', '仁愛路109號1樓', '3735051432'),
('藝佳牙醫診所', '037-682700', '頭份里中正路282號1樓', '3735051450'),
('粹齒以先牙醫診所', '037728300', '成功路177號1、2樓', '3735061189'),
('永豐牙醫診所', '04-25253168', '台中市豐原區中山路626及628號1樓', '3736012064'),
('威登牙醫診所', '04-26655335', '台中市沙鹿區成功東街45&45之1號', '3736051302'),
('新思維牙醫診所', '04-25312033', '台中市潭子區中山路一段29、31、33號1、2樓', '3736090120'),
('日信牙醫診所', '04-23372436', '台中市烏日區中山路一段435號', '3736151333'),
('李仁欽牙醫診所', '04-23914780', '台中市太平區樹孝路8號', '3736190456'),
('彰化晶華牙醫診所', '04-7293766', '信義里中正路1段346號', '3737012371'),
('英棋牙醫診所', '047-220033', '彰化縣彰化市中華路222號', '3737012479'),
('晶采牙醫診所', '04-7225333', '孔門路16、18號2樓', '3737012513'),
('彰化晶悅牙醫診所', '04-7272288', '曉陽路206號1樓', '3737012648'),
('綻美牙醫診所', '048322525', '信義巷7弄31、33號1、2樓', '3737051789'),
('信鴻牙醫診所', '04-8763839', '彰化縣田中鎮中正路383號', '3737071110'),
('英倫牙醫診所', '047-770033', '彰化縣福興鄉復興路114號1樓', '3737111057'),
('詠欣牙醫診所', '049-2203999', '南投縣南投市民族路150號1-2樓', '3738011467'),
('鼎真牙醫', '049-2353333', '南投縣草屯鎮中正路800號1．2樓', '3738031496'),
('安馨牙醫診所', '049-2336637', '南投縣草屯鎮虎山路677號1、2樓', '3738031512'),
('康適登牙醫診所', '055327338', '大同路123號', '3739011578'),
('圓恆牙醫診所', '05-5974801', '南昌路7號', '3739021154'),
('承新牙醫診所', '052203322', '嘉義縣民雄鄉福樂村埤角75-2號', '3740041206'),
('同心園牙醫診所', '08-7550799', '自由路105號3樓', '3743012019'),
('杏林牙醫診所', '087213331', '民生路67-8號1樓及2樓', '3743012127'),
('世豐牙醫診所', '08-7335226', '屏東縣屏東市忠孝路229之70號1、2樓', '3743012145'),
('屏東市-蘋果聯盟牙醫', '08-7335999', '泰安里7鄰信義路143-12號1.2F', '3743012207'),
('吃吃牙醫診所', '08-7661769', '民族路259號1、2樓', '3743012216'),
('蘋果牙醫診所', '087898080', '公園路29號', '3743021297'),
('恆美牙醫診所', '08-8880220', '山腳里恆西路33巷20號1.2樓', '3743041100'),
('麟洛牙醫診所', NULL, NULL, '3743070012'),
('風華林邊牙醫診所', '088750002', '中山路319號1、2樓', '3743191070');

-- --------------------------------------------------------

--
-- 資料表結構 `form`
--

CREATE TABLE `form` (
  `id` int(10) UNSIGNED NOT NULL,
  `name` varchar(128) NOT NULL,
  `cellphone` varchar(15) NOT NULL,
  `identity` tinyint(3) UNSIGNED NOT NULL,
  `travel_histroy` varchar(1) NOT NULL,
  `travel_country` varchar(64) DEFAULT NULL,
  `occupation` varchar(1) NOT NULL,
  `occupation_other` varchar(32) DEFAULT NULL,
  `contact_history` tinytext NOT NULL,
  `contact_multi` varchar(1) DEFAULT NULL,
  `contact_other` varchar(32) DEFAULT NULL,
  `cluster` tinytext NOT NULL,
  `cluster_multi` varchar(1) DEFAULT NULL,
  `cluster_date` date DEFAULT NULL,
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `ip_addr` varchar(15) NOT NULL,
  `cusid` varchar(15) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `form`
--

INSERT INTO `form` (`id`, `name`, `cellphone`, `identity`, `travel_histroy`, `travel_country`, `occupation`, `occupation_other`, `contact_history`, `contact_multi`, `contact_other`, `cluster`, `cluster_multi`, `cluster_date`, `created_at`, `ip_addr`, `cusid`) VALUES
(1, '陳先生', '0912345678', 1, '1', '香港', '6', '前端工程師', '[4,6]', '1', '公司', '[1,2]', '2', '2020-05-02', '2021-05-18 15:33:47', '::1', '3701013348');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `customer`
--
ALTER TABLE `customer`
  ADD PRIMARY KEY (`cusid`),
  ADD KEY `cusid` (`cusid`),
  ADD KEY `cusname` (`cusname`);

--
-- 資料表索引 `form`
--
ALTER TABLE `form`
  ADD PRIMARY KEY (`id`),
  ADD KEY `created_at` (`created_at`),
  ADD KEY `cusid` (`cusid`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `form`
--
ALTER TABLE `form`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- 已傾印資料表的限制式
--

--
-- 資料表的限制式 `form`
--
ALTER TABLE `form`
  ADD CONSTRAINT `form_ibfk_1` FOREIGN KEY (`cusid`) REFERENCES `customer` (`cusid`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
